import{g as n,s as t}from"./chunks/theme.DzUNVq4-.js";import{y as a,I as R,o as A,c as I,aC as L,J as e,j as s,a as o}from"./chunks/framework.cmjI0m29.js";const W=JSON.parse('{"title":"区块摒除法（Locked Candidates）","description":"","frontmatter":{},"headers":[],"relativePath":"advanced/locked-candidates.md","filePath":"advanced/locked-candidates.md"}'),j={name:"advanced/locked-candidates.md"},q=Object.assign(j,{setup(y){const d=`
810003290
067000000
900500006
000408000
604000809
000209000
700001008
000000370
053800042
`,g=a(n(d)),p=a(n(d));t(p.value,[[1,5,"X"],[2,4,"X"],[2,5,"X"],[2,6,"X"],[3,5,"X"],[3,6,"X"],[5,4,"X"],[5,5,"X"],[5,6,"X"],[1,4,"6"],[4,5,"6"],[6,5,"6"]]);const B=[{rows:[2,3,5],boxes:[2,5],classes:"bg-green"},{cells:["r1c4","r2c2","r3c9","r5c1"],classes:"bg-pink"},{cells:["r4c5","r6c5"],classes:"bg-purple"},{cells:["r1c4"],classes:"tip"}],u=`
059800040
000090000
000502901
006000007
900070003
400000800
804106000
000050000
030009720
`,v=a(n(u)),i=a(n(u));t(i.value,[[7,5,"X"],[8,1,"X"],[8,2,"X"],[8,3,"X"],[9,1,"X"],[9,3,"X"],[9,4,"X"],[9,5,"X"],[7,2,"7"],[8,4,"7"],[8,6,"7"]]);const k=[{rows:[9],cols:[5],boxes:[7,8],classes:"bg-green"},{cells:["r5c5","r7c2","r9c7"],classes:"bg-pink"},{cells:["r8c4","r8c6"],classes:"bg-purple"},{cells:["r7c2"],classes:"tip"}],c=`
058700002
000065000
300000009
004200900
500070004
007004800
200000008
000430000
900001360
`,m=a(n(c)),b=a(n(c));t(b.value,[[7,4,"X"],[7,5,"X"],[7,6,"X"],[7,7,"X"],[7,8,"X"],[8,6,"X"],[8,9,"X"],[9,4,"X"],[9,9,"X"],[8,7,"2"],[8,8,"2"],[9,5,"2"]]);const f=[{rows:[7],cols:[4,9],boxes:[8,9],classes:"bg-green"},{cells:["r1c9","r4c4","r7c1","r9c5"],classes:"bg-pink"},{cells:["r8c7","r8c8"],classes:"bg-purple"},{cells:["r9c5"],classes:"tip"}],C=`
050900260
100006007
000000040
800670000
000534000
000089003
090000000
300700008
028003050
`,x=a(n(C)),X=a(n(C));t(X.value,[[1,1,"X"],[1,5,"X"],[1,6,"X"],[1,9,"X"],[2,2,"X"],[2,3,"X"],[2,5,"X"],[3,1,"X"],[3,2,"X"],[3,3,"X"],[3,5,"X"],[3,6,"X"],[3,9,"X"],[1,3,"3"],[2,4,"3"],[2,7,"3"],[2,8,"3"],[3,4,"3"],[3,7,"3"]]);const z=[{cols:[1,5,6,9],boxes:[1,2,3],classes:"bg-green"},{cells:["r1c3","r5c5","r6c9","r8c1","r9c6"],classes:"bg-pink"},{cells:["r2c4","r3c4"],classes:"bg-purple"},{cells:["r2c7","r2c8","r3c7"],classes:"bg-yellow"},{cells:["r1c3"],classes:"tip"}],P=a(n(`
000300000
678950201
000021500
400000800
210048093
007000006
005830000
380007625
000005000
`)),T=[{cells:["r2c5","r2c7","r5c6","r8c2"],classes:"tip"}],N=a(n(`
080429613
000001700
020008400
000300107
030900060
809002000
003200040
008103000
592804001
`)),V=[{cells:["r1c2","r1c5","r5c4","r8c6","r9c9"],classes:"tip"}],w=["000700630200000040010340000706002100080090050005600302000085020020000003048006000","000060280103000000000107060970000500020385090006000014050706000000000305092030000","001500060956004030000020010400001002000030000500900003070060000030400896020005100","760000100000037205000000080010400600200176004004008090050000000109240000006000029","000000007060040030500300082000038010009712800010560000630007004040080050700000000","000000000009041320000803046900000700700689002004000003670302000083570200000000000","006020000000600120090000004508209300007080200003401806800000010062003000000050900","809000000004820000050000021290100006400070008500006092640000010000091300000000507","006072005801000027000100000000790000003241800000086000000009000480000901200510400","050060009006030008010000002000805300084010590001907000100000060400050800600070040","000080700036000009200000085005600041900040003710005600690000004400000920008090000","600007001070400000010000500008050307390020015105030800002000030000008090400600008"];return(G,l)=>{const r=R("Grid"),S=R("Puzzle");return A(),I("div",null,[l[0]||(l[0]=L('<h1 id="区块摒除法-locked-candidates" tabindex="-1">区块摒除法（Locked Candidates） <a class="header-anchor" href="#区块摒除法-locked-candidates" aria-label="Permalink to “区块摒除法（Locked Candidates）”">​</a></h1><p>在数独的解题中，能够直接利用盘面上的数字出数的只有三种解法：<a href="./../basic/last-value">唯一数法</a>、摒除法（按照观察目标的不同分为<a href="./../basic/hidden-single-in-box">宫摒除法</a>和<a href="./../basic/hidden-single-in-line">行列摒除法</a>）、<a href="./../basic/naked-single">唯一余数法</a>。</p><p>其中唯一数法本质上也是摒除法或唯一余数法。所以，归根结底基础法包括两种：摒除法和余数法。</p><p>除了基础解法外的解法称为进阶解法，它们用来弥补基础解法的不足，协助基础解法得解。常见的进阶解法包括：区块摒除法、数对、三链数、X-Wing 等。本页主要讨论区块摒除法。</p><p>在基础题里，利用区块摒除可以替代一些基础解法，或辅助基础解法寻找焦点。在非基础题里，区块可以隐藏任何其他结构，简单的可以把基础解法隐藏起来，难的可以隐藏数对等其他进阶技巧。</p><p>示例 1：</p>',6)),e(r,{board:g.value},null,8,["board"]),l[1]||(l[1]=s("p",null,"首先数字 6 对 B5 摒除，得到 B5 的 6 在 R4C5 或者 R6C5。不论是哪一格，C5 的其他格都不能再有数字 6。R4C5 和 R6C5 就是数字 6 的区块，这也是区块摒除作用的观点。",-1)),l[2]||(l[2]=s("p",null,"再通过数字 6 对 B2 摒除，得解 R1C4 = 6。",-1)),e(r,{board:p.value,specialCells:B},null,8,["board"]),l[3]||(l[3]=s("p",null,"示例 2：",-1)),e(r,{board:v.value},null,8,["board"]),l[4]||(l[4]=s("p",null,"第一手，数字 7 对 B8 摒除。得到 B8 的 7 在 R8C4 或者 R8C6，虽然还不能确定到底是在哪一格，但可以确定 R8 的其他格不能含有 7。",-1)),l[5]||(l[5]=s("p",null,"第二手，数字 7 对 B7 摒除。R9C7 为 7，所以同处于 R9 的 R9C1、R9C3 不能为 7。加上上一手得到的 7 区块作用效果，看出 R8C1、R8C2、R8C3 不能为 7，得到 B7 的 7 只能在 R7C2。",-1)),e(r,{board:i.value,specialCells:k},null,8,["board"]),l[6]||(l[6]=s("div",{class:"warning custom-block"},[s("p",{class:"custom-block-title"},"提示"),s("p",null,[o("运用区块观点来观察行列摒除的方法又称为 "),s("strong",null,"区块宫摒除法"),o("。虽然行列摒除能够一步到位，但是从以往的经验来看，大部分玩家还是愿意使用区块宫摒除法来观察。")])],-1)),l[7]||(l[7]=s("p",null,"示例 3：",-1)),e(r,{board:m.value},null,8,["board"]),l[8]||(l[8]=s("p",null,"第一手，数字 2 对 B9 摒除。得到 B9 的 2 在 R8C7 或 R8C8，不管是在这里两格的哪一格，R8 的其他格都不能再有 2。",-1)),l[9]||(l[9]=s("p",null,"第二手，数字 2 对 B8 摒除。经过 R4C4、R7C1 的宫摒除，以及 R8 的区块摒除，得到 R9C5 = 2。",-1)),e(r,{board:b.value,specialCells:f},null,8,["board"]),l[10]||(l[10]=s("p",null,"示例 4：",-1)),l[11]||(l[11]=s("p",null,"有时候单单一个区块时不够的，需要双区块来弥补其不足。",-1)),e(r,{board:x.value},null,8,["board"]),l[12]||(l[12]=s("p",null,"第一手，数字 3 对 B2 摒除。得到 B2 的 3 在 R2C4 或者 R3C4。",-1)),l[13]||(l[13]=s("p",null,"第二手，数字 3 对 B3 摒除。得到 B3 的 3 在 R2C7、R2C8、R3C7。",-1)),l[14]||(l[14]=s("p",null,"B2 与 B3 的3 占据了 R2、R3，也就是 B2 的 3 在 R2 的话，B3 的 3 就在 R3，反之亦然，所以 B1 中位于 R2、R3 的格均不能为 3。",-1)),l[15]||(l[15]=s("p",null,"第三手，数字 3 对 B1 摒除。得到 R1C3 = 3。",-1)),e(r,{board:X.value,specialCells:z},null,8,["board"]),l[16]||(l[16]=s("p",null,"犹如那句“不能一步登天，就一步一步登天”。行列摒除可以通过区块宫摒除，多走一步得到相同的结果。根据上面几题的比较可以看出一部分的行列摒除用单区块宫摒除是一条比较好的策略，通过中介让观察范围缩小，观察难度降低。",-1)),l[17]||(l[17]=s("p",null,"上面这个例子，是一个相当困难的行列摒除，用区块宫摒除代替的花也需要用到双区块。这是对摒除法观察力的一大考验，不过通过一些练习，相信你最终能得心应手。",-1)),l[18]||(l[18]=s("p",null,"下面这道谜题的第一解由 5 个行列摒除解，其中有 4 个可以通过区块宫摒除完成，请找找它们在哪里？（点击盘面显示答案）",-1)),e(r,{board:P.value,specialCells:T},null,8,["board"]),l[19]||(l[19]=s("p",null,"下面是一道行列摒除题，这个谜题第一解由 5 处可通过区块宫摒除达到行列摒除效果，找找看在哪里？（点击盘面显示答案）",-1)),e(r,{board:N.value,specialCells:V},null,8,["board"]),l[20]||(l[20]=s("p",null,[o("区块摒除法包括 "),s("strong",null,"宫区块"),o("（pointing）与 "),s("strong",null,"行列区块"),o("（claiming）。")],-1)),l[21]||(l[21]=s("p",null,"宫区块由宫摒除产生，其观察方法与宫摒除相同，只是摒除后这个数字在这个宫有 2 个或 3 个位置可填，且这 2 个或 3 个位置处在同一行或同一列，此时删除该行或列其他格的该数。",-1)),l[22]||(l[22]=s("p",null,"行列区块由行列摒除产生，其观察方法与行列摒除相同，只是摒除后这个数字在该行或列有 2 个或 3 个位置可填，且这 2 个或 3 个位置处在同一宫，此时删除该宫其他格的该数。",-1)),l[23]||(l[23]=s("p",null,"如果存在区块却没有可删的格，说明已经被观察过了，或者本身产生这个区块的数的影响范围包含了可删范围。",-1)),l[24]||(l[24]=s("p",null,"以下都是行列摒除题，但都可以通过区块宫摒除完成。前 6 题比较简单，后 6 题比较难一点。",-1)),e(S,{puzzles:w})])}}});export{W as __pageData,q as default};
